BusinessProcesses/СогласованиеПлатежейПоЗакупу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<BusinessProcess>
		<Properties>
			<Name>СогласованиеПлатежейПоЗакупу</Name>
			<Task>Task.ЗадачаИсполнителяПоСогласованиюПлатежей</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаявкаПрошлаСогласованиеРук</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаПрошлаСогласованиеКурирующимЧП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаПрошлаСогласованиеСогласующим</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаДиректоромКДВыполнена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаНаПолнотуСведенийВыполнена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦС_СостоянияСогласованияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетнаяДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиректорСТП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурирующийЧП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаПрошлаСогласованиеГБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительФД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаПрошлаСогласованиеРуководительФД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаВключенаВРеестр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопСогласование1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопСогласование2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КомментарииПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрикрепленныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>История</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплачено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасчетнаяТаблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДоговора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоговора</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Культура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоговора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Собственные</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заемные</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Элеватор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗерновой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗерновой</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СФ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭСФ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыписки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

InformationRegisters/Бит_АдресацияУведомленийПоКомандировкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Бит_АдресацияУведомленийПоКомандировкам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адресат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦС_ЭтапыМаршрутовБП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BusinessProcesses/СогласованиеПлатежейПоЗакупу/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	Автор = ПараметрыСеанса.ТекущийПользователь;
	Состояние = Перечисления.ЦС_СостоянияСогласованияПлатежей.ВРаботе;	
	Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнаяОрганизация");
	
КонецПроцедуры

Функция ПолучитьАдресатаДляТекущегоЭтапа(Постановщик,ТочкаЭтапа);
	
	//+++ Oleg SmartT. 2021-07-12	
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСГБ Тогда
		Если ЗначениеЗаполнено(ЭтотОбъект.ГБ) Тогда
			Возврат ЭтотОбъект.ГБ;
		КонецЕсли;
	КонецЕсли;
	
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемФД Тогда
		Если ЗначениеЗаполнено(ЭтотОбъект.РуководительФД) Тогда
			Возврат ЭтотОбъект.РуководительФД;
		КонецЕсли;
	КонецЕсли;
	//--- Oleg SmartT. 2021-07-12	
	
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.ВозвращеноАвтору Тогда
		Возврат Постановщик;
	КонецЕсли;

	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСКурирующимЧП Тогда
		Возврат КурирующийЧП;
	КонецЕсли;

	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеССогласующим Тогда
		Возврат Согласующий;
	КонецЕсли;
	
	//Рамиль +
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.ДополнительныйСогласующий1 Тогда
		Возврат ДопСогласование1;
	КонецЕсли;
	
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.ДополнительныйСогласующий2 Тогда
		Возврат ДопСогласование2;
	КонецЕсли;
	//Рамиль -

	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемСП Тогда
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ДиректорСТП) Тогда
			Возврат ЭтотОбъект.ДиректорСТП;
		КонецЕсли;
		
		Сотрудник = Справочники.СотрудникиОрганизаций.НайтиПоРеквизиту("Физлицо", Постановщик.ФизЛицо);
		Подразделение = Сотрудник.ТекущееПодразделениеОрганизации;
		
			Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бит_АдресацияУведомленийПоКомандировкам.Адресат,
		|	Бит_АдресацияУведомленийПоКомандировкам.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.Бит_АдресацияУведомленийПоКомандировкам КАК Бит_АдресацияУведомленийПоКомандировкам
		|ГДЕ
		|	(Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &Пользователь
		|			ИЛИ Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &ПустойПользователь)
		|	И Бит_АдресацияУведомленийПоКомандировкам.ЭтапМаршрута = &ЭтапМаршрута
		|	И Бит_АдресацияУведомленийПоКомандировкам.Подразделение = &Подразделение
		|
		|УПОРЯДОЧИТЬ ПО
		|	Пользователь УБЫВ";
		
		Запрос.УстановитьПараметр("Пользователь", Постановщик);
		Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());
		Запрос.УстановитьПараметр("Подразделение", Подразделение);

		Запрос.УстановитьПараметр("ЭтапМаршрута", ТочкаЭтапа);
		
		Результат = Запрос.Выполнить();
		Выборка = результат.Выбрать();
		Если Выборка.Следующий() тогда
			Возврат Выборка.Адресат;
		КонецЕсли;
		
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Бит_АдресацияУведомленийПоКомандировкам.Адресат,
	|	Бит_АдресацияУведомленийПоКомандировкам.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.Бит_АдресацияУведомленийПоКомандировкам КАК Бит_АдресацияУведомленийПоКомандировкам
	|ГДЕ
	|	(Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &Пользователь
	|			ИЛИ Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &ПустойПользователь)
	|	И Бит_АдресацияУведомленийПоКомандировкам.ЭтапМаршрута = &ЭтапМаршрута
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователь УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", Постановщик);
	Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());

	Запрос.УстановитьПараметр("ЭтапМаршрута", ТочкаЭтапа);
	
	Результат = Запрос.Выполнить();
	Выборка = результат.Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Адресат;
	КонецЕсли;
	
КонецФункции

Процедура ОбработатьЭтап(Постановщик, ТочкаЭтапа,ФормируемыеЗадачи,Отказ, ЯвныйАдресат = Неопределено)
	
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.ОтправленНаДоработкуАвтором тогда 
		Адресат = Постановщик;
	Иначе    
		Если ЯвныйАдресат = Неопределено тогда
			Адресат = ПолучитьАдресатаДляТекущегоЭтапа(Постановщик,ТочкаЭтапа);
		Иначе
			Адресат = ЯвныйАдресат;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если Адресат = Неопределено или Адресат.Пустая() тогда 
		Отказ = Истина;
		Сообщить("Для текущего пользователя на этапе " + ТочкаЭтапа + " не найден адресат");
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача из ФормируемыеЗадачи Цикл
		
		Если ТипЗнч(Адресат) = Тип("СправочникСсылка.Пользователи") тогда
			Задача.Пользователь = Адресат;
		Иначе
			Задача.Подразделение = Адресат;
		КонецЕсли;
		ЦС_ОбщегоНазначенияСервер.ОтправитьПисьмоПоИзменениюЗаявок(Задача.бизнеспроцесс, Адресат, Задача);
	КонецЦикла;
	
	ЭтотОбъект.Записать();

КонецПроцедуры

Процедура ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат,МаркерЭтапа)
	
	Если МаркерЭтапа = "Разрешено" тогда
		Результат = ТочкаВыбораВарианта.Варианты.Разрешено;
	ИначеЕсли МаркерЭтапа = "Возвращено" тогда
		Результат = ТочкаВыбораВарианта.Варианты.Возвращено;
	ИначеЕсли МаркерЭтапа = "Отказано" тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказано;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ТекущаяТочка = ТочкаМаршрутаБизнесПроцесса;
	
	Если ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.СогласованиеСРП") Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемСП;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.СогласованиеСКурирующимЧП")	Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСКурирующимЧП;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.СогласованиеССогласующим")	Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеССогласующим;
		//ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.СогласованиеСРуководителемКД")	Тогда
		//	Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемКД;
		//Рамиль + 	
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.ДопСогласование1") Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.ДополнительныйСогласующий1;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.ДопСогласование2") Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.ДополнительныйСогласующий2;
		//Рамиль -
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.СогласованиеСГБ")	Тогда     
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСГБ;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.СогласованиеСФД")	Тогда  
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемФД;
		
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.ПередачаВКазначейство") Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.ПередачаВКазначейство;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.РаботаСЗаявкойАвтором") Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.ВозвращеноАвтору;
	КонецЕсли;	
	
	ОбработатьЭтап(Автор, Этап, ФормируемыеЗадачи, Отказ);
	
КонецПроцедуры

Процедура РезультатПроверкиВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекущаяТочка = ТочкаВыбораВарианта;
	
	Если ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.РезультатПроверкиСТП") Тогда
		МаркерЭтапа = ЗаявкаПрошлаСогласованиеРук;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.РезультатПроверкиКурирующимЧП")	Тогда
		МаркерЭтапа = ЗаявкаПрошлаСогласованиеКурирующимЧП; 
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.РезультатПроверкиСогласующий")	Тогда
		МаркерЭтапа = ЗаявкаПрошлаСогласованиеСогласующим; 	
		
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.РезультатСогласованиеСГБ")	Тогда      
		МаркерЭтапа = ЗаявкаПрошлаСогласованиеГБ; 	
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.РезультатСогласованиеСФД")	Тогда      
		МаркерЭтапа = ЗаявкаПрошлаСогласованиеРуководительФД; 	
		//Рамиль +
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.РезультатДопСогласования1") Тогда
		МаркерЭтапа = "Разрешено";
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.РезультатДопСогласования2") Тогда
		МаркерЭтапа = "Разрешено";
		//Рамиль -
		//ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.РезльтатПроверкиКазначейства")	Тогда
		//	МаркерЭтапа = ПроверкаНаПолнотуСведенийВыполнена; 		
	КонецЕсли;
	
	ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат, МаркерЭтапа);	
		
КонецПроцедуры

Процедура Условие1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Если ЗначениеЗаполнено(Согласующий) Тогда
		Результат = Истина
	Иначе
		Результат = Ложь;
	КонецЕсли;

КонецПроцедуры


Процедура РезультатДиректорДКОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат, ПроверкаДиректоромКДВыполнена);	
	
	Если Результат = ТочкаВыбораВарианта.Варианты.Отказано Тогда  
		Завершен = Истина;
		Состояние = Перечисления.ЦС_СостоянияСогласованияПлатежей.ОтказанРуководителемДепартамента;
	КонецЕсли;
	
КонецПроцедуры

Процедура СогласованиеСРуководителемКДПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ОбработатьЭтап(Автор,Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемКД,ФормируемыеЗадачи,Отказ);
	
КонецПроцедуры

Процедура СозданиеПППриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ОбработатьЭтап(Автор,Справочники.ЦС_ЭтапыМаршрутовБП.СозданиеПП,ФормируемыеЗадачи,Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ЗаявкаПрошлаСогласованиеКурирующимЧП = "";
	ЭтотОбъект.ЗаявкаПрошлаСогласованиеРук = "";
	ЭтотОбъект.ЗаявкаПрошлаСогласованиеСогласующим = "";
	ЭтотОбъект.ПроверкаДиректоромКДВыполнена = "";
	ЭтотОбъект.ПроверкаНаПолнотуСведенийВыполнена = "";
	
	ЭтотОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
	
	ЭтотОбъект.Подписи.Очистить();

КонецПроцедуры

Процедура ЕстьДопСогласование1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Если ЗначениеЗаполнено(ДопСогласование1) Тогда
		Результат =  Истина;
	Иначе
		Результат =  Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ЕстьДопСогласование2ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Если ЗначениеЗаполнено(ДопСогласование2) Тогда
		Результат =  Истина;
	Иначе
		Результат =  Ложь;
	КонецЕсли;
КонецПроцедуры
